In [15]:
# Print all the variables, not only the last one
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd

# Series
ordered，indexed，vertical list

### Establish

In [3]:
data = [1,2,3]
index = ['a','b','c']
s = pd.Series(data=data, index=index, name = 'sss')
s

s2 = pd.Series([100, "Python", "C++", 3.1415])  #未指定索引，默认0，1，2，3
s2

sd = {"python":8000, "C++":8100, "Java":4000}   # Established by dictionary
s3 = pd.Series(sd)
s3

python    8000
C++       8100
Java      4000
dtype: int64

In [4]:
s.index
s.name
s.values
s.dtype

Index(['a', 'b', 'c'], dtype='object')

'sss'

array([1, 2, 3])

dtype('int64')

### Search

In [5]:
s['a']   ## search by index
s[1]   ## search by location
s[0:3]
s[[0,2]]
s['a':'c']

mask = [False,True,False]
s[mask]

## Same usage as s.loc[], while s.iloc[] can only search by location

1

2

a    1
b    2
c    3
Name: sss, dtype: int64

a    1
c    3
Name: sss, dtype: int64

a    1
b    2
c    3
Name: sss, dtype: int64

b    2
Name: sss, dtype: int64

### Modify

In [6]:
## directly modify
s_ = s.copy()  ## keep a backup
s_['a']=10
s_

a    10
b     2
c     3
Name: sss, dtype: int64

In [7]:
## modify by function
s_ = s.copy()
s_=s_.replace(to_replace = 1, value = 100)  ## The original value can only be modified after assignment
s_

a    100
b      2
c      3
Name: sss, dtype: int64

### Add

In [8]:
s_add = pd.Series([22,33],index=['d','e'])
s=s.append(s_add)
s

a     1
b     2
c     3
d    22
e    33
dtype: int64

### Delete

In [9]:
s=s.drop('e')
s

a     1
b     2
c     3
d    22
dtype: int64

### Operation functions

In [10]:
## Basic
s*3
s+5
s+s

a     3
b     6
c     9
d    66
dtype: int64

a     6
b     7
c     8
d    27
dtype: int64

a     2
b     4
c     6
d    44
dtype: int64

In [11]:
## Null function
sd = {"python":8000, "C++":8100, "Java":4000}
s4 = pd.Series(sd, index=["Java", "python", "C++", "C#"])
s4
pd.isnull(s4)
pd.notnull(s4)

Java      4000.0
python    8000.0
C++       8100.0
C#           NaN
dtype: float64

Java      False
python    False
C++       False
C#         True
dtype: bool

Java       True
python     True
C++        True
C#        False
dtype: bool

In [12]:
## Filter by comparsion
s5 = pd.Series([3,9,4,7], index=['a', 'b', 'c', 'd'])
s5[s5 > 5]

b    9
d    7
dtype: int64

In [ ]:
## String m
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)

data.str.contains('gmail')

data.str[:5]

In [4]:
## Sort
s.sort_values()

a    1
b    2
c    3
Name: sss, dtype: int64

In [6]:
## Unique
s6 = pd.Series([3,3,4,7,7], index=['a', 'b', 'c', 'd', 'e'])
s6.unique()

array([3, 4, 7])

# DataFrame Basic

### Establish

In [17]:
data = [[1,2,3],
       [4,5,6]]
index = ['a','b']
columns = ['A','B','C']
df = pd.DataFrame(data=data, index = index, columns = columns)
df

data2 = [["yahoo",200,9],
         ["google",400,3],
         ["facebook", 800, 7]]
columns2=['name','price','marks']
df2 = pd.DataFrame(data=data2, columns=columns2) 
df2

   A  B  C
a  1  2  3
b  4  5  6

       name  price  marks
0     yahoo    200      9
1    google    400      3
2  facebook    800      7

#### Establish by .csv file
pd.read_csv(filepath_or_buffer, sep=',', header='infer', names=None,index_col=None, encoding=None )
- filepath_or_buffer：路径和文件名不要带中文，带中文容易报错。
- sep: csv文件数据的分隔符，默认是','，根据实际情况修改；
- header：如果有列名，那么这一项不用改；
- names：如果没有列名，那么必须设置header = None， names为列名的列表，不设置默认生成数值索引；
- index_col：int型，选取这一列作为索引。 index_col = 'Id'
- encoding：根据你的文档编码来确定，如果有中文读取报错，试试encoding = 'gbk'。

#### Ouput to .csv file
pd.to_csv(filepath)

#### Establish by .excel file
pd.read_excel(io, sheetname=0, header=0, index_col=None, names=None)

In [5]:
df3 = pd.read_csv('tips.csv')
df3.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
## Example for Excel
#  df.to_excel('foo.xlsx', sheet_name='Sheet1')
#  pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

### View

In [7]:
df.head(3)
df.tail(4)

   A  B  C
a  1  2  3
b  4  5  6

   A  B  C
a  1  2  3
b  4  5  6

In [8]:
df2.index
df2.values
df2.columns

RangeIndex(start=0, stop=3, step=1)

array([['yahoo', 200, 9],
       ['google', 400, 3],
       ['facebook', 800, 7]], dtype=object)

Index(['name', 'price', 'marks'], dtype='object')

In [9]:
df2.name  ## Columns can be used as characters, output one column as Series

0       yahoo
1      google
2    facebook
Name: name, dtype: object

### Rename

In [1]:
df_temp=df2
df_temp
df_temp=df_temp.rename(index={2:3}, columns={'name': 'Name'})

df_temp

NameError: name 'df2' is not defined

### Select
The selected value should be assigned to another variable, the original frame won't change.

In [26]:
data2[:2]
data2[2]
data2[2][0]
data2[2][1:]

[['yahoo', 200, 9], ['google', 400, 3]]

['facebook', 800, 7]

'facebook'

[800, 7]

In [19]:
## Select by index, row fist, column second
df.loc['b','B'] 
df.loc['a':'b', 'B'] 
df.loc[['a','b'],'B']
df.loc['a':'b', 'B':'C'] 
df.loc[['a','b'],'B':'C']

5

a    2
b    5
Name: B, dtype: int64

a    2
b    5
Name: B, dtype: int64

   B  C
a  2  3
b  5  6

   B  C
a  2  3
b  5  6

In [20]:
## Select by location, row fist, column second
df.iloc[1,1]
df.iloc[0:2,0]
df.iloc[:,0:2]
df.iloc[:,[0,2]]
df.iloc[[0,1],[0,2]]

5

a    1
b    4
Name: A, dtype: int64

   A  B
a  1  2
b  4  5

   A  C
a  1  3
b  4  6

   A  C
a  1  3
b  4  6

In [21]:
## Select by conditions
df = pd.DataFrame(np.random.randn(6,4),columns=list('ABCD'))
df['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df
df[df['A'] > 0]
df[df['E'].isin(['two', 'four'])]

          A         B         C         D      E
0  1.416463  1.534803 -0.039238 -1.349024    one
1 -1.220832 -0.417268  0.192930  0.015296    one
2  1.836111  2.813839 -0.206427 -1.739594    two
3 -1.738370 -1.372725  0.666551 -0.990732  three
4 -0.297733  0.775822  0.453096  0.151829   four
5  0.736654  0.737234  0.134216  1.804651  three

          A         B         C         D      E
0  1.416463  1.534803 -0.039238 -1.349024    one
2  1.836111  2.813839 -0.206427 -1.739594    two
5  0.736654  0.737234  0.134216  1.804651  three

          A         B         C         D     E
2  1.836111  2.813839 -0.206427 -1.739594   two
4 -0.297733  0.775822  0.453096  0.151829  four

### Modify

In [22]:
## Modify single value
df_ = df.copy()
df_.loc[0,'A'] = 10
df_

           A         B         C         D      E
0  10.000000  1.534803 -0.039238 -1.349024    one
1  -1.220832 -0.417268  0.192930  0.015296    one
2   1.836111  2.813839 -0.206427 -1.739594    two
3  -1.738370 -1.372725  0.666551 -0.990732  three
4  -0.297733  0.775822  0.453096  0.151829   four
5   0.736654  0.737234  0.134216  1.804651  three

In [23]:
## Modify one column's value
df_.loc[:,'D'] = np.array(np.random.randn(6))
df_

           A         B         C         D      E
0  10.000000  1.534803 -0.039238  1.604505    one
1  -1.220832 -0.417268  0.192930  0.101208    one
2   1.836111  2.813839 -0.206427 -2.393890    two
3  -1.738370 -1.372725  0.666551  0.942996  three
4  -0.297733  0.775822  0.453096  0.208258   four
5   0.736654  0.737234  0.134216  0.398590  three

In [24]:
## Modify indexes
# df_.index = ['a','b','c','d','e','f']
df_.index = pd.date_range('20130102',periods=6)
df_.columns = ['F','G','H','I','J']
df_

                    F         G         H         I      J
2013-01-02  10.000000  1.534803 -0.039238  1.604505    one
2013-01-03  -1.220832 -0.417268  0.192930  0.101208    one
2013-01-04   1.836111  2.813839 -0.206427 -2.393890    two
2013-01-05  -1.738370 -1.372725  0.666551  0.942996  three
2013-01-06  -0.297733  0.775822  0.453096  0.208258   four
2013-01-07   0.736654  0.737234  0.134216  0.398590  three

### Add

In [25]:
df = pd.DataFrame(data=data, index = index, columns = columns)

## add a row
df.loc['c'] = [7,8,9]
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [26]:
## add several rows
df_tmp = pd.DataFrame([[22,33,44],[55,66]], index = ['d','e'],columns = ['A','B','C'])  ## Nan still can be added
df=pd.concat([df,df_tmp], axis = 0 )
df

    A   B     C
a   1   2   3.0
b   4   5   6.0
c   7   8   9.0
d  22  33  44.0
e  55  66   NaN

In [27]:
## Add a column
customers=pd.Series([500,600,700])
df2['customers']=customers
df2

       name  price  marks  customers
0     yahoo    200      9        500
1    google    400      3        600
2  facebook    800      7        700

In [28]:
## Add several columns：concat
df_tmp = pd.DataFrame([[220,'Yang'],[440,'Indiot'],[500,'Zake']], index = [0,1,2], columns = ['Employees','Boss'])
df2=pd.concat([df2,df_tmp], axis =1)
df2

       name  price  marks  customers  Employees    Boss
0     yahoo    200      9        500        220    Yang
1    google    400      3        600        440  Indiot
2  facebook    800      7        700        500    Zake

### Delete
axis=0 indicates rows, axis=1 indicates columns

In [29]:
## delete rows
df=df.drop(['a','c'],axis =0)
df

    A   B     C
b   4   5   6.0
d  22  33  44.0
e  55  66   NaN

In [30]:
## delete columns
df2=df2.drop(['customers','Boss'],axis = 1)
df2

       name  price  marks  Employees
0     yahoo    200      9        220
1    google    400      3        440
2  facebook    800      7        500

### Merge

In [33]:
df1 = pd.DataFrame([[1,2],[3,4]], index = ['a','b'],columns = ['A','B'])
df1
df2 = pd.DataFrame([[1,3],[4,8]], index = ['b','d'],columns = ['B','C'])
df2

   A  B
a  1  2
b  3  4

   B  C
b  1  3
d  4  8

In [34]:
pd.merge(left = df1, right = df2, how = 'inner' )    ##
pd.merge(left = df1, right = df2, how = 'outer' )    ##

   A  B  C
0  3  4  8

     A  B    C
0  1.0  2  NaN
1  3.0  4  8.0
2  NaN  1  3.0

In [35]:
pd.merge(left = df1, right = df2, how = 'inner' ,left_index = True, right_index = True)    ##
pd.merge(left = df1, right = df2, how = 'outer' ,left_index = True, right_index = True)    ##

   A  B_x  B_y  C
b  3    4    1  3

     A  B_x  B_y    C
a  1.0  2.0  NaN  NaN
b  3.0  4.0  1.0  3.0
d  NaN  NaN  4.0  8.0

In [36]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1,2]})
left
right = pd.DataFrame({'key':['foo', 'foo'], 'lval':[4,5]})
right
pd.merge(left, right, on='key')

   key  lval
0  foo     1
1  foo     2

   key  lval
0  foo     4
1  foo     5

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

### Overall information

In [38]:
df3.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

In [39]:
## pivot table, organize data by tree structure
df = pd.DataFrame({'col 1' : ['one', 'one', 'two', 'three'] * 3,
                   'col 2' : ['A', 'B', 'C'] * 4,
                   'col 3' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'col 4' : np.random.randn(12),
                   'col 5' : np.random.randn(12)})
df

pd.pivot_table(df, values='col 4', index=['col 1', 'col 2'], columns=['col 3'])

    col 1 col 2 col 3     col 4     col 5
0     one     A   foo  1.799034 -1.853991
1     one     B   foo -0.754785 -1.116979
2     two     C   foo  2.298555 -1.435776
3   three     A   bar -0.249127 -0.692882
4     one     B   bar  0.257100  0.453519
5     one     C   bar -1.065095  1.116222
6     two     A   foo  0.944234  1.687667
7   three     B   foo  0.647186  0.326488
8     one     C   foo -0.458708 -0.772015
9     one     A   bar  1.151843  1.641260
10    two     B   bar -0.070018 -0.115553
11  three     C   bar -0.688743  1.681908

col 3             bar       foo
col 1 col 2
one   A      1.151843  1.799034
      B      0.257100 -0.754785
      C     -1.065095 -0.458708
three A     -0.249127       NaN
      B           NaN  0.647186
      C     -0.688743       NaN
two   A           NaN  0.944234
      B     -0.070018       NaN
      C           NaN  2.298555